src/SteadyState/Cyclic/setups.orig/common/0.orig/Moisture
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Moisture;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform  0;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    "(inlet|outlet)"
    {
        type            cyclic;
    }
    
    sides
    {
        type            empty;
    }    
}


// ************************************************************************* //
