src/SteadyState/Cyclic/setups.orig/common/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 283;

boundaryField
{
    bottom
    {
        /*type            atmTurbulentHeatFluxTemperature;
        heatSource      flux;
        alphaEff        alphaEff;
        Cp0             1005.0;
        q               uniform 0.0;
        value           uniform 283;*/
        type           fixedValue;
        value          uniform 283;        
    }

    top
    {
        type           fixedValue;
        value          uniform 283;
    }

    "(inlet|outlet)"
    {
        type            cyclic;
    }
    
    sides
    {
        type            empty;
    }    
}


// ************************************************************************* //
