src/SteadyState/Cyclic/setups.orig/common/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

if [ ! -d constant/polyMesh ]
then
    runApplication blockMesh
 
    runApplication topoSet 

    runApplication checkMesh -allTopology -allGeometry -constant
fi

#------------------------------------------------------------------------------
