src/SteadyState/Cyclic/setups.orig/common/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              1.5e-05;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3e-03;

// Reference temperature
TRef            283;

// Laminar Prandtl number
Pr              0.9;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.7;

// Net radiation
Hr              Hr [1 0 -3 0 0 0 0] 30;

// Specific heat of air
cp              cp [0 2 -2 -1 0 0 0] 1.005e3;

// Latent heat of vapourisation
lmb             lmb [0 2 -2 0 0 0 0] 2.25e6;

// Psychrometric constant
psy             psy [1 -1 -2 -1 0 0 0] 66e-03;

// Aerodynamic resistance
ra              ra [0 -1 1 0 0 0 0] 2.0;
// ************************************************************************* //
