src/SteadyState/Cyclic/setups.orig/common/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0   0   0)
    (300 0   0)
    (300 1 0)
    (0   1 0)
    (0   0   1000)
    (300 0   1000)
    (300 1 1000)
    (0   1 1000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 300) simpleGrading (1 1 50)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
