src/SteadyState/Cyclic/setups.orig/common/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Make sure all utilities know specialised models
libs            (atmosphericModels);

application     buoyantBoussinesqSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         400000;

deltaT          1;

writeControl    timeStep;

writeInterval   100000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

allowSystemOperations 1;

functions
{
    /*
    writeCellCentres1
    {
	// Mandatory entries (unmodifiable)
	type            writeCellCentres;
	libs            (fieldFunctionObjects);
    }
    */

        Moisture
	{
	    type                scalarTransport;
	    libs                (solverFunctionObjects);
	    outputControl       outputTime;
	    active              true;
	    autoSchemes         false;
	    nCorr               0;
	    field               Moisture;
	    resetOnStartUp      false;
	    fvOptions
	    {
		MoistureSource
		{
		    type                scalarCodedSource;
		    name                sourceTime;
		    scalarCodedSourceCoeffs
		    {
		        selectionMode   all;
		        volumeMode      specific;
		        fields          (Moisture);
		        nut             nut;
		        name            sourceTime;
		        codeInclude
		        #{
		            #include "fvCFD.H"
		            #include "fvc.H"
		        #};
		        codeCorrect
		        #{
		        #};
		        codeAddSup
		        #{
		            const Time& time = mesh().time();
		            // Pull cell volumes
		            const scalarField& V = mesh_.V();
		            const vectorField& C = mesh_.C();
		            // const volScalarField& cellz = mesh_.C().component(2);
		            const volVectorField& U = mesh().lookupObject<volVectorField>("U");
			    label sink = mesh().cellZones().findZoneID("sink");
			    label nonsink = mesh().cellZones().findZoneID("nonsink");
			    const labelList& sinkcells = mesh().cellZones()[sink];
			    const labelList& nonsinkcells = mesh().cellZones()[nonsink];
			    			    		    
		            // Pull leaf area density, Temperature, Moisture, and density fields
		            const volScalarField& LAD = mesh_.lookupObject<volScalarField>("LAD");
		            const volScalarField& T = mesh_.lookupObject<volScalarField>("T");
		            const volScalarField& q = mesh_.lookupObject<volScalarField>("Moisture");
		            const volScalarField& rhos = mesh_.lookupObject<volScalarField>("rhok");

		            // Define parameters
		            const scalar startiteration = 100000;
		            const scalar& Hr = 30;
		            const scalar& cp = 1.005e3;
		            const scalar& lmb = 2.25e6;
		            const scalar& psy = 66e-3;
		            const scalar& Rspec = 461.5;
		            const scalar& kappa = 0.4;
		            double EPMTotal = 0;
		            double EPMGen = 0;
		            double CondenseTotal = 0;
		            double ATMExtract = 0;

		            scalarField& EPMsource = eqn.source();

		            // Apply the source
		            if (time.value() >= startiteration)
		            {
		                forAll(V, i)
		                {
		                    if (LAD[i] != 0)
		                    {
		                        // Cell volume specific source

		                        // Sub-calculation 1
		                        scalar vap_exp = Foam::exp((17.67 * (T[i] - 273.15)) / (T[i] - 273.15 + 243.5));
		                        scalar sat_vap = 100 * 6.1904 * vap_exp;
		                        scalar vap_pres = Rspec * T[i] * q[i] / V[i];
		                        scalar delta_sat_vap = 100 * 26170.1 * vap_exp / pow((T[i] - 273.15 + 243.5), 2);
		                        scalar ra_m = pow(Foam::log(C[i].z() / 2.0), 2.0) / (kappa * kappa * mag(U[i]));
		                        // scalar ra_m = C[i].z();

		                        scalar term1 = Hr * delta_sat_vap;

		                        // Sub-calculation 2
		                        scalar term2 = cp * rhos[i] * (sat_vap - vap_pres) / ra_m;

		                        // Sub-calculation 3
		                        scalar term3 = lmb * (psy + delta_sat_vap);

		                        // Final calculation of EPMsource[i]
		                        //Info << "LAD i: = " << i << endl;
		                        //Info << "LAD: = " << LAD[i] << endl;
		                        //Info << "q: = " << q[i] << endl;
		                        //Info << "Vol: = " << V[i] << endl;
		                        //Info << "ea: = " << vap_pres << endl;

		                        if (vap_pres > sat_vap)
		                        {
		                            scalar condense = (vap_pres - sat_vap) * V[i] / (Rspec * T[i]);
		                            //Info << "Condense: = " << condense << endl;
		                            EPMsource[i] = condense;
		                            CondenseTotal += -condense;
		                        }
		                        else
		                        {
		                            //Info << "Top rhos: = " << rhos[i] << endl;
		                            scalar source = -LAD[i] * V[i] * (term1 + term2) / term3;
		                            EPMsource[i] = source;
		                            EPMGen += -source;
		                            
		                        }
		                        EPMTotal += -EPMsource[i];
		                        
		                        //Info << "CanopySource: = " << EPMsource[i] << endl;
		                    }
		                    else if (i >= 14950)
		                    {
		                        //scalar vap_pres2 = Rspec * T[i] * q[i] / V[i];
		                        //Info << "Top current q: = " << q[i] << endl;
		                        //Info << "Top current ea: = " << vap_pres2 << endl;
		                        scalar extract = q[i];
		                    	EPMsource[i] = extract;
		                    	ATMExtract += -extract;
		                    }
		                    else if (i < 14950 && LAD[i] == 0)
		                    {
		                        //Info << "remaining source : = 0" << endl;
		                        EPMsource[i] = 0;
		                    }                    
		                };
		                reduce(EPMTotal, sumOp<scalar>());
		                reduce(EPMGen, sumOp<scalar>());
		                reduce(CondenseTotal, sumOp<scalar>());
		                reduce(ATMExtract, sumOp<scalar>());
		                Info << "EPMSourceTotal: = " << EPMTotal << endl;
		                Info << "EPMGeneration: = " << EPMGen << endl;
		                Info << "CanopyCondenseTotal: = " << CondenseTotal << endl;
		                Info << "Extracted in Atmosphere: = " << ATMExtract << endl;		                		                
		            }
		            else if (time.value() == startiteration - 1)
		            {
		            	forAll(V, i)
		                {
		            	    EPMsource[i] = 0;
		            	    //Info << "InitialCell: = " << i<< endl;		            	    
		            	    //Info << "InitialVol: = " << V[i]<< endl;
		            	    //Info << "Initial ea: = " << Rspec * T[i] * q[i] / V[i]<< endl;		            	    
		            	    //Info << "InitialSource: = " << -0.007 * V[i]<< endl;
		                }
		            }
		            else
		            {
		            	forAll(V, i)
		                {
		            	    EPMsource[i] = 0;
		                }
		            }		            
		            
		        #};
		        codeConstrain
		        #{
		        #};
		    }
		}
	    }
	}


	CanopyMass
	{
	    type            coded;
	    libs            ("libutilityFunctionObjects.so");
	    name            CanopyMass;
	    writeControl    timeStep;

	    codeWrite
	    #{
		const scalarField& V = mesh().V();
		const volScalarField& q = mesh().lookupObject<volScalarField>("Moisture");
		const volScalarField& LAD = mesh().lookupObject<volScalarField>("LAD");

                double CanopyMassSum = 0;
                double TotalMassSum = 0;
                double OutsideCanopyMassSum = 0;
                scalar sum = gSum(q);
	        forAll (V, cellI)
	        {
	         
	         TotalMassSum += q[cellI];
	         
	         if (LAD[cellI] != 0) {	
	    	   CanopyMassSum += q[cellI];
	    	 }
	    	 else {
	    	 OutsideCanopyMassSum += q[cellI];
	    	 }  	 
	        }
	        
	        //Sync the summation across all processors
	        reduce(CanopyMassSum, sumOp<scalar>());
       	        reduce(OutsideCanopyMassSum, sumOp<scalar>());
	        reduce(TotalMassSum, sumOp<scalar>());
	        
		Info<< "CanopyMass: = " << CanopyMassSum << endl
		    << "MassOutOfCanopy: = " << OutsideCanopyMassSum << endl
   		    << "TotalMoisture: = " << TotalMassSum << endl
       		    //<< "TotalMoisture2: = " << sum << endl
		    << endl;
	    
		//volIntegral.write();

	    #}; 
	}

    #includeFunc "turbulenceFields"
}


// ************************************************************************* //
