src/SteadyState/Cyclic/setups.orig/common/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    sinkset;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0  0 990)(300 1 1000);
    }
    
    {
        name    nonsinkset;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     sinkset;
    }

    {
        name    nonsinkset;
        type    cellSet;
        action  invert;
    }
    
    {
        name    sink;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     sinkset;
    }
    
    {
        name    nonsink;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     nonsinkset;
    }
);


// ************************************************************************* //
