src/SteadyState/Cyclic/setups.orig/common/system/turbulenceFields
// -*- C++ -*-

type            turbulenceFields;
libs            (fieldFunctionObjects);
field           R;
writeControl    writeTime;


// *********************************************************************** //
